#include <stdio.h>

/*
* 1) 전역변수
*  -장점
*   함수의 호출이 끝나도 값을 보관할 수 있다.
*   어느 함수에서나 가져다 사용할 수 있다.
*   다른 *.c 파일에서도 접근할 수 있다.(extern이라는 키워드로)
*  -단점
*   함수와 함수의 모듈화를 방해한다.(분업화에 위배 -> 비용 증가)
*   값이 잘 못 전달되면 사용하는 다른 곳에서 에러가 발생된다.
    (여기저기서 에러 -> 에러 원인 찾기가 쉽지 않다)
   - Java/C#은 전역변수를 아예 없앴다.(클래스간의 논리성/역할/설계를 중요시하는 언어라서...)
   - Python/Javascript는 전역변수가 있다.(편의성을 중요시하는 언어라서...)

  2) 지역변수
   -장점
     지역내에서만 사용가능하다.(다른 지역의 지역변수 접근 불가)
	 함수나 {}영역에 들어서면 Stack에 올라갔다가, 해당 지역이 끝나면 Stack에서 소멸된다.
	 수시로 생성했다가 소멸시키므로 Stack메모리를 작게 만들 수 있는 장점이 있다.
	 전역변수보다는 지역변수를 사용할 때 모듈화/분업화가 유리하다.
   -단점
     함수 호출이 끝나면 값을 보관할 수 없다.

  3) static 지역변수
   - 해당 지역에서만 사용가능하다.
   - 전역변수가 저장되는 Data Area영역에 저장되므로 함수 호출이 끝나도 소멸되지 않는다.
     (프로그램이 처음 실행될 때 전역변수와 동일하게 Data Area영역에 올라가고
	  프로그램이 끝날 때 소멸된다)

  4) static 전역변수
   - 해당 *.c 파일 내에서만 사용가능하다.(다른 파일에서는 접근할 수 없다)
   - 주로 라이브러리를 만들 때 사용한다.
*/

int countFunc()
{
	static int count = 0;
	count++;
	return count;
}

void callNumFunc(int param)
{
	printf("함수 호출 횟수는 %d입니다\n", param);
}

void main()
{
	int num = 0;
	for (int i = 0;i < 10;i++)
		num = countFunc();

	callNumFunc(num);
}